/*
	题目背景
	猪猪hanke得到了一只鸡
	
	题目描述
	猪猪Hanke特别喜欢吃烤鸡（本是同畜牲，相煎何太急！）Hanke吃鸡很特别，为什么特别呢？因为他有10种配料（芥末、孜然等），每种配料可以放1—3克，任意烤鸡的美味程度为所有配料质量之和
	
	现在，Hanke想要知道，如果给你一个美味程度，请输出这10种配料的所有搭配方案
	
	输入格式
	一行,n<=5000
	
	输出格式
	第一行，方案总数
	
	第二行至结束，10个数，表示每种配料所放的质量
	
	按字典序排列。
	
	如果没有符合要求的方法，就只要在第一行输出一个“0”
	
	输入输出样例
	输入 #1
	11
	输出 #1
	10
	1 1 1 1 1 1 1 1 1 2 
	1 1 1 1 1 1 1 1 2 1 
	1 1 1 1 1 1 1 2 1 1 
	1 1 1 1 1 1 2 1 1 1 
	1 1 1 1 1 2 1 1 1 1 
	1 1 1 1 2 1 1 1 1 1 
	1 1 1 2 1 1 1 1 1 1 
	1 1 2 1 1 1 1 1 1 1 
	1 2 1 1 1 1 1 1 1 1
	2 1 1 1 1 1 1 1 1 1
*/
#include<stdio.h>
int main()
{
    int a,b,c,d,e,f,g,h,x,y,n,num=0;
    scanf("%d",&n);
    for(a=1;a<=3;a++)
    {
        for(b=1;b<=3;b++)
        {
            for(c=1;c<=3;c++)
            {
                for(d=1;d<=3;d++)
                {
                    for(e=1;e<=3;e++)
                    {
                        for(f=1;f<=3;f++)
                        {
                            for(g=1;g<=3;g++)
                            {
                                for(h=1;h<=3;h++)
                                {
                                    for(x=1;x<=3;x++)
                                    {
                                        for(y=1;y<=3;y++)
                                        {
                                            if(a+b+c+d+e+f+g+h+x+y==n)
                                            {
                                                num++;
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
    printf("%d\n",num);
    for(a=1;a<=3;a++)
    {
        for(b=1;b<=3;b++)
        {
            for(c=1;c<=3;c++)
            {
                for(d=1;d<=3;d++)
                {
                    for(e=1;e<=3;e++)
                    {
                        for(f=1;f<=3;f++)
                        {
                            for(g=1;g<=3;g++)
                            {
                                for(h=1;h<=3;h++)
                                {
                                    for(x=1;x<=3;x++)
                                    {
                                        for(y=1;y<=3;y++)
                                        {
                                            if(a+b+c+d+e+f+g+h+x+y==n)
                                            {
                                                printf("%d %d %d %d %d %d %d %d %d %d\n",a,b,c,d,e,f,g,h,x,y);
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
    return 0;
}

